In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
df=pd.read_csv(r'Datos\gpu_metadata.csv')
df2=pd.read_csv(r'Datos\gpu_price_history.csv')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     48 non-null     object
 1   Wattage  48 non-null     object
 2   VRAM     48 non-null     object
 3   3DMARK   48 non-null     int64
dtypes: int64(1), object(3)
memory usage: 1.6+ KB

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1087 entries, 0 to 1086
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          1087 non-null   object
 1   Name          1087 non-null   object
 2   Retail Price  1087 non-null   int64
 3   Used Price    1087 non-null   int64
dtypes: int64(2), object(2)
memory usage: 34.1+ KB

In [12]:
df.head()

                     Name Wattage VRAM  3DMARK
0        GeForce GTX 1050     75W  2GB    1861
1     GeForce GTX 1050 Ti     75W  4GB    2356
2        GeForce GTX 1060    120W  6GB    4215
3        GeForce GTX 1650     75W  4GB    3552
4  GeForce GTX 1660 SUPER    125W  6GB    6078

In [13]:
df2.head()

       Date              Name  Retail Price  Used Price
0  01-01-24  GeForce GTX 1050             0           0
1  01-02-24  GeForce GTX 1050             0           0
2  01-03-23  GeForce GTX 1050           192          61
3  01-03-24  GeForce GTX 1050           254          52
4  01-04-23  GeForce GTX 1050           181          55

In [14]:
df.describe()

             3DMARK
count     48.000000
mean   12561.916667
std     8629.770759
min     1195.000000
25%     4816.250000
50%    11561.500000
75%    19288.250000
max    35966.000000

In [18]:
df2.describe()

       Retail Price   Used Price
count   1087.000000  1087.000000
mean     478.281509   312.383625
std      412.893707   306.037560
min        0.000000     0.000000
25%      211.500000    90.000000
50%      339.000000   235.000000
75%      611.000000   425.000000
max     2229.000000  2119.000000

In [19]:
df.sample(5)

                      Name Wattage  VRAM  3DMARK
19  GeForce RTX 4070 SUPER    220W  12GB   21214
7      GeForce RTX 2080 Ti    250W  11GB   14628
10     GeForce RTX 3060 Ti    200W   8GB   11744
2         GeForce GTX 1060    120W   6GB    4215
47      Radeon RX 7900 XTX    355W  24GB   29246

In [20]:
df2.sample(5)

         Date                 Name  Retail Price  Used Price
494  01-08-24  GeForce RTX 4070 Ti           757         592
668  01-06-23        Radeon RX 560           112          63
918  01-02-23    Radeon RX 6800 XT           705         480
876  01-07-23    Radeon RX 6750 XT           363         363
885  01-11-23    Radeon RX 6750 XT           341         317